Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxEvadc_PinMap_TC38x_516.c
const IfxEvadc_Vadcg_In *IfxEvadc_Vadcg_In_pinTable[IFXEVADC_PINMAP_NUM_MODULES][IFXEVADC_PINMAP_NUM_GROUPS][IFXEVADC_PINMAP_VADCG_IN_NUM_ITEMS] = {
    {
        {
            &IfxEvadc_G0CH0_AN0_IN,
            &IfxEvadc_G0CH1_AN1_IN,
            &IfxEvadc_G0CH2_AN2_IN,
            &IfxEvadc_G0CH3_AN3_IN,
            &IfxEvadc_G0CH4_AN4_IN,
            &IfxEvadc_G0CH5_AN5_IN,
            &IfxEvadc_G0CH6_AN6_IN,
            &IfxEvadc_G0CH7_AN7_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G1CH0_AN8_IN,
            &IfxEvadc_G1CH1_AN9_IN,
            &IfxEvadc_G1CH2_AN10_IN,
            &IfxEvadc_G1CH3_AN11_IN,
            &IfxEvadc_G1CH4_AN12_IN,
            &IfxEvadc_G1CH5_AN13_IN,
            &IfxEvadc_G1CH6_AN14_IN,
            &IfxEvadc_G1CH7_AN15_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G2CH0_AN16_IN,
            &IfxEvadc_G2CH1_P40_10_IN,
            &IfxEvadc_G2CH2_P40_11_IN,
            &IfxEvadc_G2CH3_P40_12_IN,
            &IfxEvadc_G2CH4_AN20_IN,
            &IfxEvadc_G2CH5_AN21_IN,
            &IfxEvadc_G2CH6_AN22_IN,
            &IfxEvadc_G2CH7_AN23_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G3CH0_P40_0_IN,
            &IfxEvadc_G3CH1_P40_1_IN,
            &IfxEvadc_G3CH2_P40_2_IN,
            &IfxEvadc_G3CH3_P40_3_IN,
            &IfxEvadc_G3CH4_P40_13_IN,
            &IfxEvadc_G3CH5_P40_14_IN,
            &IfxEvadc_G3CH6_AN30_IN,
            &IfxEvadc_G3CH7_AN31_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G4CH0_AN40_IN,
            &IfxEvadc_G4CH1_AN41_IN,
            &IfxEvadc_G4CH2_AN42_IN,
            &IfxEvadc_G4CH3_AN43_IN,
            &IfxEvadc_G4CH4_P40_13_IN,
            &IfxEvadc_G4CH5_P40_14_IN,
            &IfxEvadc_G4CH6_AN30_IN,
            &IfxEvadc_G4CH7_AN31_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G5CH0_AN48_IN,
            &IfxEvadc_G5CH1_AN49_IN,
            &IfxEvadc_G5CH2_AN50_IN,
            &IfxEvadc_G5CH3_AN51_IN,
            &IfxEvadc_G5CH4_AN52_IN,
            &IfxEvadc_G5CH5_AN53_IN,
            &IfxEvadc_G5CH6_P41_4_IN,
            &IfxEvadc_G5CH7_P41_5_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G6CH0_AN56_IN,
            &IfxEvadc_G6CH1_AN57_IN,
            &IfxEvadc_G6CH2_AN58_IN,
            &IfxEvadc_G6CH3_AN59_IN,
            &IfxEvadc_G6CH4_AN60_IN,
            &IfxEvadc_G6CH5_AN61_IN,
            &IfxEvadc_G6CH6_P41_6_IN,
            &IfxEvadc_G6CH7_P41_7_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G7CH0_P41_8_IN,
            &IfxEvadc_G7CH1_AN65_IN,
            &IfxEvadc_G7CH2_AN66_IN,
            &IfxEvadc_G7CH3_P40_15_IN,
            &IfxEvadc_G7CH4_P41_0_IN,
            &IfxEvadc_G7CH5_P41_1_IN,
            &IfxEvadc_G7CH6_P41_2_IN,
            &IfxEvadc_G7CH7_P41_3_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G8CH0_P40_4_IN,
            &IfxEvadc_G8CH1_P40_5_IN,
            &IfxEvadc_G8CH2_AN34_IN,
            &IfxEvadc_G8CH3_AN35_IN,
            &IfxEvadc_G8CH4_P40_6_IN,
            &IfxEvadc_G8CH5_P40_7_IN,
            &IfxEvadc_G8CH6_P40_8_IN,
            &IfxEvadc_G8CH7_P40_9_IN,
            &IfxEvadc_G8CH8_AN40_IN,
            &IfxEvadc_G8CH9_AN41_IN,
            &IfxEvadc_G8CH10_AN42_IN,
            &IfxEvadc_G8CH11_AN43_IN,
            &IfxEvadc_G8CH12_AN44_IN,
            &IfxEvadc_G8CH13_AN45_IN,
            &IfxEvadc_G8CH14_AN46_IN,
            &IfxEvadc_G8CH15_AN47_IN
        },
        {
            &IfxEvadc_G9CH0_P00_12_IN,
            &IfxEvadc_G9CH1_P00_11_IN,
            &IfxEvadc_G9CH2_P00_10_IN,
            &IfxEvadc_G9CH3_P00_9_IN,
            &IfxEvadc_G9CH4_P00_8_IN,
            &IfxEvadc_G9CH5_P00_7_IN,
            &IfxEvadc_G9CH6_P00_6_IN,
            &IfxEvadc_G9CH7_P00_5_IN,
            &IfxEvadc_G9CH8_P00_4_IN,
            &IfxEvadc_G9CH9_P00_3_IN,
            &IfxEvadc_G9CH10_P00_2_IN,
            &IfxEvadc_G9CH11_P00_1_IN,
            &IfxEvadc_G9CH12_P01_5_IN,
            &IfxEvadc_G9CH13_P01_4_IN,
            &IfxEvadc_G9CH14_P01_3_IN,
            &IfxEvadc_G9CH15_P02_11_IN
        },
        {
            &IfxEvadc_G10CH0_P33_7_IN,
            &IfxEvadc_G10CH1_P33_6_IN,
            &IfxEvadc_G10CH2_P33_5_IN,
            &IfxEvadc_G10CH3_P33_4_IN,
            &IfxEvadc_G10CH4_P33_3_IN,
            &IfxEvadc_G10CH5_P33_2_IN,
            &IfxEvadc_G10CH6_P33_1_IN,
            &IfxEvadc_G10CH7_P33_0_IN,
            &IfxEvadc_G10CH8_P34_4_IN,
            &IfxEvadc_G10CH9_P34_3_IN,
            &IfxEvadc_G10CH10_P34_2_IN,
            &IfxEvadc_G10CH11_P34_1_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_G11CH0_AN4_IN,
            &IfxEvadc_G11CH1_AN5_IN,
            &IfxEvadc_G11CH2_AN6_IN,
            &IfxEvadc_G11CH3_AN7_IN,
            &IfxEvadc_G11CH4_AN8_IN,
            &IfxEvadc_G11CH5_AN9_IN,
            &IfxEvadc_G11CH6_AN10_IN,
            &IfxEvadc_G11CH7_AN11_IN,
            &IfxEvadc_G11CH8_P40_11_IN,
            &IfxEvadc_G11CH9_P40_12_IN,
            &IfxEvadc_G11CH10_P40_2_IN,
            &IfxEvadc_G11CH11_P40_3_IN,
            &IfxEvadc_G11CH12_P40_4_IN,
            &IfxEvadc_G11CH13_P40_5_IN,
            &IfxEvadc_G11CH14_AN34_IN,
            &IfxEvadc_G11CH15_AN35_IN
        },
        {
            &IfxEvadc_FC0CH0_AN16_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_FC1CH0_P40_10_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_FC2CH0_P00_12_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEvadc_FC3CH0_P00_11_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        }
    }
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
